RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1C/source/pin_packages/cyhal_xmc7100_100_teqfp.c
/* Connections for: eth_mdc */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_mdc[1] = {
    {0u, 0u, P3_1, P3_1_ETH0_MDC},
};

/* Connections for: eth_mdio */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_mdio[1] = {
    {0u, 0u, P3_0, P3_0_ETH0_MDIO},
};

/* Connections for: eth_ref_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_ref_clk[1] = {
    {0u, 0u, P18_0, P18_0_ETH0_REF_CLK},
};

/* Connections for: eth_rx_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_rx_clk[1] = {
    {0u, 0u, P23_3, P23_3_ETH0_RX_CLK},
};

/* Connections for: eth_rx_ctl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_rx_ctl[1] = {
    {0u, 0u, P21_5, P21_5_ETH0_RX_CTL},
};

/* Connections for: eth_rx_er */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_rx_er[1] = {
    {0u, 0u, P2_2, P2_2_ETH0_RX_ER},
};

/* Connections for: eth_rxd */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_rxd[4] = {
    {0u, 0u, P19_0, P19_0_ETH0_RXD0},
    {0u, 1u, P19_1, P19_1_ETH0_RXD1},
    {0u, 2u, P19_2, P19_2_ETH0_RXD2},
    {0u, 3u, P19_3, P19_3_ETH0_RXD3},
};

/* Connections for: eth_tx_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_tx_clk[1] = {
    {0u, 0u, P18_3, P18_3_ETH0_TX_CLK},
};

/* Connections for: eth_tx_ctl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_tx_ctl[1] = {
    {0u, 0u, P18_1, P18_1_ETH0_TX_CTL},
};

/* Connections for: eth_tx_er */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_tx_er[1] = {
    {0u, 0u, P18_2, P18_2_ETH0_TX_ER},
};

/* Connections for: eth_txd */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_txd[4] = {
    {0u, 0u, P18_4, P18_4_ETH0_TXD0},
    {0u, 1u, P18_5, P18_5_ETH0_TXD1},
    {0u, 2u, P18_6, P18_6_ETH0_TXD2},
    {0u, 3u, P18_7, P18_7_ETH0_TXD3},
};

/* Connections for: lin_lin_en */
const cyhal_resource_pin_mapping_t cyhal_pin_map_lin_lin_en[12] = {
    {0u, 1u, P0_2, P0_2_LIN0_LIN_EN1},
    {0u, 0u, P2_2, P2_2_LIN0_LIN_EN0},
    {0u, 7u, P5_2, P5_2_LIN0_LIN_EN7},
    {0u, 9u, P6_0, P6_0_LIN0_LIN_EN9},
    {0u, 3u, P6_2, P6_2_LIN0_LIN_EN3},
    {0u, 4u, P6_5, P6_5_LIN0_LIN_EN4},
    {0u, 4u, P7_2, P7_2_LIN0_LIN_EN4},
    {0u, 2u, P8_2, P8_2_LIN0_LIN_EN2},
    {0u, 6u, P12_1, P12_1_LIN0_LIN_EN6},
    {0u, 3u, P13_2, P13_2_LIN0_LIN_EN3},
    {0u, 8u, P13_6, P13_6_LIN0_LIN_EN8},
    {0u, 9u, P23_7, P23_7_LIN0_LIN_EN9},
};

/* Connections for: lin_lin_rx */
const cyhal_resource_pin_mapping_t cyhal_pin_map_lin_lin_rx[17] = {
    {0u, 1u, P0_0, P0_0_LIN0_LIN_RX1},
    {0u, 0u, P2_0, P2_0_LIN0_LIN_RX0},
    {0u, 5u, P2_3, P2_3_LIN0_LIN_RX5},
    {0u, 7u, P5_0, P5_0_LIN0_LIN_RX7},
    {0u, 10u, P5_2, P5_2_LIN0_LIN_RX10},
    {0u, 2u, P5_3, P5_3_LIN0_LIN_RX2},
    {0u, 3u, P6_0, P6_0_LIN0_LIN_RX3},
    {0u, 4u, P6_3, P6_3_LIN0_LIN_RX4},
    {0u, 4u, P7_0, P7_0_LIN0_LIN_RX4},
    {0u, 10u, P7_5, P7_5_LIN0_LIN_RX10},
    {0u, 2u, P8_0, P8_0_LIN0_LIN_RX2},
    {0u, 6u, P12_2, P12_2_LIN0_LIN_RX6},
    {0u, 3u, P13_0, P13_0_LIN0_LIN_RX3},
    {0u, 2u, P13_3, P13_3_LIN0_LIN_RX2},
    {0u, 8u, P13_4, P13_4_LIN0_LIN_RX8},
    {0u, 0u, P21_5, P21_5_LIN0_LIN_RX0},
    {0u, 9u, P23_5, P23_5_LIN0_LIN_RX9},
};

/* Connections for: lin_lin_tx */
const cyhal_resource_pin_mapping_t cyhal_pin_map_lin_lin_tx[16] = {
    {0u, 1u, P0_1, P0_1_LIN0_LIN_TX1},
    {0u, 0u, P2_1, P2_1_LIN0_LIN_TX0},
    {0u, 15u, P5_0, P5_0_LIN0_LIN_TX15},
    {0u, 7u, P5_1, P5_1_LIN0_LIN_TX7},
    {0u, 10u, P5_3, P5_3_LIN0_LIN_TX10},
    {0u, 3u, P6_1, P6_1_LIN0_LIN_TX3},
    {0u, 4u, P6_4, P6_4_LIN0_LIN_TX4},
    {0u, 4u, P7_1, P7_1_LIN0_LIN_TX4},
    {0u, 2u, P8_1, P8_1_LIN0_LIN_TX2},
    {0u, 6u, P12_3, P12_3_LIN0_LIN_TX6},
    {0u, 3u, P13_1, P13_1_LIN0_LIN_TX3},
    {0u, 2u, P13_4, P13_4_LIN0_LIN_TX2},
    {0u, 8u, P13_5, P13_5_LIN0_LIN_TX8},
    {0u, 12u, P18_0, P18_0_LIN0_LIN_TX12},
    {0u, 6u, P23_3, P23_3_LIN0_LIN_TX6},
    {0u, 9u, P23_6, P23_6_LIN0_LIN_TX9},
};

/* Connections for: pass_sar_ext_mux_en */
const cyhal_resource_pin_mapping_t cyhal_pin_map_pass_sar_ext_mux_en[2] = {
    {0u, 1u, P12_2, P12_2_PASS0_SAR_EXT_MUX_EN1},
    {0u, 2u, P13_3, P13_3_PASS0_SAR_EXT_MUX_EN2},
};

/* Connections for: pass_sar_ext_mux_sel */
const cyhal_resource_pin_mapping_t cyhal_pin_map_pass_sar_ext_mux_sel[5] = {
    {0u, 3u, P12_3, P12_3_PASS0_SAR_EXT_MUX_SEL3},
    {0u, 4u, P12_4, P12_4_PASS0_SAR_EXT_MUX_SEL4},
    {0u, 6u, P13_0, P13_0_PASS0_SAR_EXT_MUX_SEL6},
    {0u, 7u, P13_1, P13_1_PASS0_SAR_EXT_MUX_SEL7},
    {0u, 8u, P13_2, P13_2_PASS0_SAR_EXT_MUX_SEL8},
};

/* Connections for: pass_sarmux_pads */
const cyhal_resource_pin_mapping_t cyhal_pin_map_pass_sarmux_pads[37] = {
    {0u, 0u, P6_0, HSIOM_SEL_GPIO},
    {0u, 1u, P6_1, HSIOM_SEL_GPIO},
    {0u, 2u, P6_2, HSIOM_SEL_GPIO},
    {0u, 3u, P6_3, HSIOM_SEL_GPIO},
    {0u, 4u, P6_4, HSIOM_SEL_GPIO},
    {0u, 5u, P6_5, HSIOM_SEL_GPIO},
    {2u, 0u, P7_0, HSIOM_SEL_GPIO},
    {2u, 1u, P7_1, HSIOM_SEL_GPIO},
    {2u, 2u, P7_2, HSIOM_SEL_GPIO},
    {2u, 3u, P7_3, HSIOM_SEL_GPIO},
    {2u, 4u, P7_4, HSIOM_SEL_GPIO},
    {2u, 5u, P7_5, HSIOM_SEL_GPIO},
    {3u, 0u, P8_1, HSIOM_SEL_GPIO},
    {3u, 1u, P8_2, HSIOM_SEL_GPIO},
    {4u, 4u, P12_0, HSIOM_SEL_GPIO},
    {4u, 5u, P12_1, HSIOM_SEL_GPIO},
    {4u, 6u, P12_2, HSIOM_SEL_GPIO},
    {4u, 7u, P12_3, HSIOM_SEL_GPIO},
    {5u, 0u, P12_4, HSIOM_SEL_GPIO},
    {5u, 4u, P13_0, HSIOM_SEL_GPIO},
    {5u, 5u, P13_1, HSIOM_SEL_GPIO},
    {5u, 6u, P13_2, HSIOM_SEL_GPIO},
    {5u, 7u, P13_3, HSIOM_SEL_GPIO},
    {6u, 0u, P13_4, HSIOM_SEL_GPIO},
    {6u, 1u, P13_5, HSIOM_SEL_GPIO},
    {6u, 2u, P13_6, HSIOM_SEL_GPIO},
    {6u, 3u, P13_7, HSIOM_SEL_GPIO},
    {6u, 4u, P14_0, HSIOM_SEL_GPIO},
    {6u, 5u, P14_1, HSIOM_SEL_GPIO},
    {8u, 0u, P18_0, HSIOM_SEL_GPIO},
    {8u, 1u, P18_1, HSIOM_SEL_GPIO},
    {8u, 2u, P18_2, HSIOM_SEL_GPIO},
    {8u, 3u, P18_3, HSIOM_SEL_GPIO},
    {8u, 4u, P18_4, HSIOM_SEL_GPIO},
    {8u, 5u, P18_5, HSIOM_SEL_GPIO},
    {8u, 6u, P18_6, HSIOM_SEL_GPIO},
    {8u, 7u, P18_7, HSIOM_SEL_GPIO},
};

/* Connections for: peri_tr_io_input */
/* The actual channel_num has no value to how the connection works. However, the HAL driver needs
   to know the index of the input or output trigger line. Store that in the channel_num field
   instead. */
const cyhal_resource_pin_mapping_t cyhal_pin_map_peri_tr_io_input[14] = {
    {0u, 2u, P2_0, P2_0_PERI_TR_IO_INPUT2},
    {0u, 3u, P2_1, P2_1_PERI_TR_IO_INPUT3},
    {0u, 4u, P2_2, P2_2_PERI_TR_IO_INPUT4},
    {0u, 5u, P2_3, P2_3_PERI_TR_IO_INPUT5},
    {0u, 14u, P8_1, P8_1_PERI_TR_IO_INPUT14},
    {0u, 15u, P8_2, P8_2_PERI_TR_IO_INPUT15},
    {0u, 20u, P12_0, P12_0_PERI_TR_IO_INPUT20},
    {0u, 21u, P12_1, P12_1_PERI_TR_IO_INPUT21},
    {0u, 22u, P13_6, P13_6_PERI_TR_IO_INPUT22},
    {0u, 23u, P13_7, P13_7_PERI_TR_IO_INPUT23},
    {0u, 28u, P19_2, P19_2_PERI_TR_IO_INPUT28},
    {0u, 29u, P19_3, P19_3_PERI_TR_IO_INPUT29},
    {0u, 30u, P23_3, P23_3_PERI_TR_IO_INPUT30},
    {0u, 31u, P23_4, P23_4_PERI_TR_IO_INPUT31},
};

