RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1C/source/pin_packages/cyhal_xmc7100_100_teqfp.c
/* Connections for: smif_spi_data0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data0[1] = {
    {0u, 0u, P7_1, P7_1_SMIF0_SPIHB_DATA0},
};

/* Connections for: smif_spi_data1 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data1[1] = {
    {0u, 0u, P7_2, P7_2_SMIF0_SPIHB_DATA1},
};

/* Connections for: smif_spi_data2 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data2[1] = {
    {0u, 0u, P7_3, P7_3_SMIF0_SPIHB_DATA2},
};

/* Connections for: smif_spi_data3 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data3[1] = {
    {0u, 0u, P7_4, P7_4_SMIF0_SPIHB_DATA3},
};

/* Connections for: smif_spi_data4 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data4[1] = {
    {0u, 0u, P7_5, P7_5_SMIF0_SPIHB_DATA4},
};

/* Connections for: smif_spi_data5 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data5[1] = {
    {0u, 0u, P8_0, P8_0_SMIF0_SPIHB_DATA5},
};

/* Connections for: smif_spi_data6 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data6[1] = {
    {0u, 0u, P8_1, P8_1_SMIF0_SPIHB_DATA6},
};

/* Connections for: smif_spi_data7 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data7[1] = {
    {0u, 0u, P8_2, P8_2_SMIF0_SPIHB_DATA7},
};

/* Connections for: smif_spi_rwds */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_rwds[1] = {
    {0u, 0u, P6_4, P6_4_SMIF0_SPIHB_RWDS},
};

/* Connections for: smif_spi_select0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_select0[1] = {
    {0u, 0u, P6_5, P6_5_SMIF0_SPIHB_SELECT0},
};

/* Connections for: smif_spi_select1 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_select1[1] = {
    {0u, 0u, P7_0, P7_0_SMIF0_SPIHB_SELECT1},
};

/* Connections for: tcpwm_line */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tcpwm_line[80] = {
    {0u, 18u, P0_0, P0_0_TCPWM0_LINE18},
    {0u, 17u, P0_1, P0_1_TCPWM0_LINE17},
    {0u, 14u, P0_2, P0_2_TCPWM0_LINE14},
    {0u, 13u, P0_3, P0_3_TCPWM0_LINE13},
    {0u, 7u, P2_0, P2_0_TCPWM0_LINE7},
    {0u, 6u, P2_1, P2_1_TCPWM0_LINE6},
    {0u, 5u, P2_2, P2_2_TCPWM0_LINE5},
    {0u, 4u, P2_3, P2_3_TCPWM0_LINE4},
    {0u, 1u, P3_0, P3_0_TCPWM0_LINE1},
    {0u, 0u, P3_1, P3_1_TCPWM0_LINE0},
    {0u, 9u, P5_0, P5_0_TCPWM0_LINE9},
    {0u, 10u, P5_1, P5_1_TCPWM0_LINE10},
    {0u, 11u, P5_2, P5_2_TCPWM0_LINE11},
    {0u, 12u, P5_3, P5_3_TCPWM0_LINE12},
    {1u, 0u, P6_0, P6_0_TCPWM0_LINE256},
    {0u, 0u, P6_1, P6_1_TCPWM0_LINE0},
    {1u, 1u, P6_2, P6_2_TCPWM0_LINE257},
    {0u, 1u, P6_3, P6_3_TCPWM0_LINE1},
    {1u, 2u, P6_4, P6_4_TCPWM0_LINE258},
    {0u, 2u, P6_5, P6_5_TCPWM0_LINE2},
    {1u, 4u, P7_0, P7_0_TCPWM0_LINE260},
    {0u, 15u, P7_1, P7_1_TCPWM0_LINE15},
    {1u, 5u, P7_2, P7_2_TCPWM0_LINE261},
    {0u, 16u, P7_3, P7_3_TCPWM0_LINE16},
    {1u, 6u, P7_4, P7_4_TCPWM0_LINE262},
    {0u, 17u, P7_5, P7_5_TCPWM0_LINE17},
    {0u, 19u, P8_0, P8_0_TCPWM0_LINE19},
    {0u, 20u, P8_1, P8_1_TCPWM0_LINE20},
    {0u, 21u, P8_2, P8_2_TCPWM0_LINE21},
    {0u, 61u, P11_0, P11_0_TCPWM0_LINE61},
    {0u, 60u, P11_1, P11_1_TCPWM0_LINE60},
    {0u, 59u, P11_2, P11_2_TCPWM0_LINE59},
    {0u, 36u, P12_0, P12_0_TCPWM0_LINE36},
    {0u, 37u, P12_1, P12_1_TCPWM0_LINE37},
    {0u, 38u, P12_2, P12_2_TCPWM0_LINE38},
    {0u, 39u, P12_3, P12_3_TCPWM0_LINE39},
    {0u, 40u, P12_4, P12_4_TCPWM0_LINE40},
    {1u, 8u, P13_0, P13_0_TCPWM0_LINE264},
    {0u, 44u, P13_1, P13_1_TCPWM0_LINE44},
    {1u, 9u, P13_2, P13_2_TCPWM0_LINE265},
    {0u, 45u, P13_3, P13_3_TCPWM0_LINE45},
    {1u, 10u, P13_4, P13_4_TCPWM0_LINE266},
    {2u, 4u, P13_4, P13_4_TCPWM0_LINE516},
    {0u, 46u, P13_5, P13_5_TCPWM0_LINE46},
    {1u, 11u, P13_6, P13_6_TCPWM0_LINE267},
    {2u, 5u, P13_6, P13_6_TCPWM0_LINE517},
    {0u, 47u, P13_7, P13_7_TCPWM0_LINE47},
    {0u, 48u, P14_0, P14_0_TCPWM0_LINE48},
    {2u, 6u, P14_0, P14_0_TCPWM0_LINE518},
    {0u, 49u, P14_1, P14_1_TCPWM0_LINE49},
    {1u, 6u, P18_0, P18_0_TCPWM0_LINE262},
    {2u, 0u, P18_0, P18_0_TCPWM0_LINE512},
    {1u, 7u, P18_1, P18_1_TCPWM0_LINE263},
    {0u, 55u, P18_2, P18_2_TCPWM0_LINE55},
    {2u, 1u, P18_2, P18_2_TCPWM0_LINE513},
    {0u, 54u, P18_3, P18_3_TCPWM0_LINE54},
    {0u, 53u, P18_4, P18_4_TCPWM0_LINE53},
    {2u, 2u, P18_4, P18_4_TCPWM0_LINE514},
    {0u, 52u, P18_5, P18_5_TCPWM0_LINE52},
    {0u, 51u, P18_6, P18_6_TCPWM0_LINE51},
    {2u, 3u, P18_6, P18_6_TCPWM0_LINE515},
    {0u, 50u, P18_7, P18_7_TCPWM0_LINE50},
    {1u, 3u, P19_0, P19_0_TCPWM0_LINE259},
    {0u, 26u, P19_1, P19_1_TCPWM0_LINE26},
    {0u, 27u, P19_2, P19_2_TCPWM0_LINE27},
    {0u, 28u, P19_3, P19_3_TCPWM0_LINE28},
    {0u, 42u, P21_0, P21_0_TCPWM0_LINE42},
    {0u, 41u, P21_1, P21_1_TCPWM0_LINE41},
    {0u, 40u, P21_2, P21_2_TCPWM0_LINE40},
    {0u, 39u, P21_3, P21_3_TCPWM0_LINE39},
    {0u, 34u, P21_5, P21_5_TCPWM0_LINE34},
    {0u, 37u, P21_5, P21_5_TCPWM0_LINE37},
    {0u, 33u, P22_1, P22_1_TCPWM0_LINE33},
    {0u, 32u, P22_2, P22_2_TCPWM0_LINE32},
    {0u, 31u, P22_3, P22_3_TCPWM0_LINE31},
    {1u, 11u, P23_3, P23_3_TCPWM0_LINE267},
    {0u, 25u, P23_4, P23_4_TCPWM0_LINE25},
    {0u, 24u, P23_5, P23_5_TCPWM0_LINE24},
    {0u, 23u, P23_6, P23_6_TCPWM0_LINE23},
    {0u, 22u, P23_7, P23_7_TCPWM0_LINE22},
};

/* Connections for: tcpwm_line_compl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tcpwm_line_compl[82] = {
    {0u, 22u, P0_0, P0_0_TCPWM0_LINE_COMPL22},
    {0u, 18u, P0_1, P0_1_TCPWM0_LINE_COMPL18},
    {0u, 17u, P0_2, P0_2_TCPWM0_LINE_COMPL17},
    {0u, 14u, P0_3, P0_3_TCPWM0_LINE_COMPL14},
    {0u, 8u, P2_0, P2_0_TCPWM0_LINE_COMPL8},
    {0u, 7u, P2_1, P2_1_TCPWM0_LINE_COMPL7},
    {0u, 6u, P2_2, P2_2_TCPWM0_LINE_COMPL6},
    {0u, 5u, P2_3, P2_3_TCPWM0_LINE_COMPL5},
    {0u, 2u, P3_0, P3_0_TCPWM0_LINE_COMPL2},
    {2u, 6u, P3_0, P3_0_TCPWM0_LINE_COMPL518},
    {0u, 1u, P3_1, P3_1_TCPWM0_LINE_COMPL1},
    {2u, 7u, P3_1, P3_1_TCPWM0_LINE_COMPL519},
    {0u, 8u, P5_0, P5_0_TCPWM0_LINE_COMPL8},
    {0u, 9u, P5_1, P5_1_TCPWM0_LINE_COMPL9},
    {0u, 10u, P5_2, P5_2_TCPWM0_LINE_COMPL10},
    {0u, 11u, P5_3, P5_3_TCPWM0_LINE_COMPL11},
    {0u, 14u, P6_0, P6_0_TCPWM0_LINE_COMPL14},
    {1u, 0u, P6_1, P6_1_TCPWM0_LINE_COMPL256},
    {0u, 0u, P6_2, P6_2_TCPWM0_LINE_COMPL0},
    {1u, 1u, P6_3, P6_3_TCPWM0_LINE_COMPL257},
    {0u, 1u, P6_4, P6_4_TCPWM0_LINE_COMPL1},
    {1u, 2u, P6_5, P6_5_TCPWM0_LINE_COMPL258},
    {0u, 3u, P7_0, P7_0_TCPWM0_LINE_COMPL3},
    {1u, 4u, P7_1, P7_1_TCPWM0_LINE_COMPL260},
    {0u, 15u, P7_2, P7_2_TCPWM0_LINE_COMPL15},
    {1u, 5u, P7_3, P7_3_TCPWM0_LINE_COMPL261},
    {0u, 16u, P7_4, P7_4_TCPWM0_LINE_COMPL16},
    {1u, 6u, P7_5, P7_5_TCPWM0_LINE_COMPL262},
    {0u, 18u, P8_0, P8_0_TCPWM0_LINE_COMPL18},
    {0u, 19u, P8_1, P8_1_TCPWM0_LINE_COMPL19},
    {0u, 20u, P8_2, P8_2_TCPWM0_LINE_COMPL20},
    {0u, 62u, P11_0, P11_0_TCPWM0_LINE_COMPL62},
    {0u, 61u, P11_1, P11_1_TCPWM0_LINE_COMPL61},
    {0u, 60u, P11_2, P11_2_TCPWM0_LINE_COMPL60},
    {0u, 35u, P12_0, P12_0_TCPWM0_LINE_COMPL35},
    {0u, 36u, P12_1, P12_1_TCPWM0_LINE_COMPL36},
    {0u, 37u, P12_2, P12_2_TCPWM0_LINE_COMPL37},
    {0u, 38u, P12_3, P12_3_TCPWM0_LINE_COMPL38},
    {0u, 39u, P12_4, P12_4_TCPWM0_LINE_COMPL39},
    {0u, 43u, P13_0, P13_0_TCPWM0_LINE_COMPL43},
    {1u, 8u, P13_1, P13_1_TCPWM0_LINE_COMPL264},
    {0u, 44u, P13_2, P13_2_TCPWM0_LINE_COMPL44},
    {1u, 9u, P13_3, P13_3_TCPWM0_LINE_COMPL265},
    {0u, 45u, P13_4, P13_4_TCPWM0_LINE_COMPL45},
    {1u, 10u, P13_5, P13_5_TCPWM0_LINE_COMPL266},
    {2u, 4u, P13_5, P13_5_TCPWM0_LINE_COMPL516},
    {0u, 46u, P13_6, P13_6_TCPWM0_LINE_COMPL46},
    {1u, 11u, P13_7, P13_7_TCPWM0_LINE_COMPL267},
    {2u, 5u, P13_7, P13_7_TCPWM0_LINE_COMPL517},
    {0u, 47u, P14_0, P14_0_TCPWM0_LINE_COMPL47},
    {0u, 48u, P14_1, P14_1_TCPWM0_LINE_COMPL48},
    {2u, 6u, P14_1, P14_1_TCPWM0_LINE_COMPL518},
    {1u, 5u, P18_0, P18_0_TCPWM0_LINE_COMPL261},
    {1u, 6u, P18_1, P18_1_TCPWM0_LINE_COMPL262},
    {2u, 0u, P18_1, P18_1_TCPWM0_LINE_COMPL512},
    {1u, 7u, P18_2, P18_2_TCPWM0_LINE_COMPL263},
    {0u, 55u, P18_3, P18_3_TCPWM0_LINE_COMPL55},
    {2u, 1u, P18_3, P18_3_TCPWM0_LINE_COMPL513},
    {0u, 54u, P18_4, P18_4_TCPWM0_LINE_COMPL54},
    {0u, 53u, P18_5, P18_5_TCPWM0_LINE_COMPL53},
    {2u, 2u, P18_5, P18_5_TCPWM0_LINE_COMPL514},
    {0u, 52u, P18_6, P18_6_TCPWM0_LINE_COMPL52},
    {0u, 51u, P18_7, P18_7_TCPWM0_LINE_COMPL51},
    {2u, 3u, P18_7, P18_7_TCPWM0_LINE_COMPL515},
    {0u, 50u, P19_0, P19_0_TCPWM0_LINE_COMPL50},
    {1u, 3u, P19_1, P19_1_TCPWM0_LINE_COMPL259},
    {0u, 26u, P19_2, P19_2_TCPWM0_LINE_COMPL26},
    {0u, 27u, P19_3, P19_3_TCPWM0_LINE_COMPL27},
    {0u, 43u, P21_0, P21_0_TCPWM0_LINE_COMPL43},
    {0u, 42u, P21_1, P21_1_TCPWM0_LINE_COMPL42},
    {0u, 41u, P21_2, P21_2_TCPWM0_LINE_COMPL41},
    {0u, 40u, P21_3, P21_3_TCPWM0_LINE_COMPL40},
    {0u, 35u, P21_5, P21_5_TCPWM0_LINE_COMPL35},
    {0u, 38u, P21_5, P21_5_TCPWM0_LINE_COMPL38},
    {0u, 34u, P22_1, P22_1_TCPWM0_LINE_COMPL34},
    {0u, 33u, P22_2, P22_2_TCPWM0_LINE_COMPL33},
    {0u, 32u, P22_3, P22_3_TCPWM0_LINE_COMPL32},
    {1u, 10u, P23_3, P23_3_TCPWM0_LINE_COMPL266},
    {1u, 11u, P23_4, P23_4_TCPWM0_LINE_COMPL267},
    {0u, 25u, P23_5, P23_5_TCPWM0_LINE_COMPL25},
    {0u, 24u, P23_6, P23_6_TCPWM0_LINE_COMPL24},
    {0u, 23u, P23_7, P23_7_TCPWM0_LINE_COMPL23},
};

/* Connections for: tcpwm_tr_one_cnt_in */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tcpwm_tr_one_cnt_in[154] = {
    {0u, 54u, P0_0, P0_0_TCPWM0_TR_ONE_CNT_IN54},
    {0u, 67u, P0_0, P0_0_TCPWM0_TR_ONE_CNT_IN67},
    {0u, 51u, P0_1, P0_1_TCPWM0_TR_ONE_CNT_IN51},
    {0u, 55u, P0_1, P0_1_TCPWM0_TR_ONE_CNT_IN55},
    {0u, 42u, P0_2, P0_2_TCPWM0_TR_ONE_CNT_IN42},
    {0u, 52u, P0_2, P0_2_TCPWM0_TR_ONE_CNT_IN52},
    {0u, 39u, P0_3, P0_3_TCPWM0_TR_ONE_CNT_IN39},
    {0u, 43u, P0_3, P0_3_TCPWM0_TR_ONE_CNT_IN43},
    {0u, 21u, P2_0, P2_0_TCPWM0_TR_ONE_CNT_IN21},
    {0u, 25u, P2_0, P2_0_TCPWM0_TR_ONE_CNT_IN25},
    {6u, 12u, P2_0, P2_0_TCPWM0_TR_ONE_CNT_IN1548},
    {0u, 18u, P2_1, P2_1_TCPWM0_TR_ONE_CNT_IN18},
    {0u, 22u, P2_1, P2_1_TCPWM0_TR_ONE_CNT_IN22},
    {6u, 15u, P2_1, P2_1_TCPWM0_TR_ONE_CNT_IN1551},
    {0u, 15u, P2_2, P2_2_TCPWM0_TR_ONE_CNT_IN15},
    {0u, 19u, P2_2, P2_2_TCPWM0_TR_ONE_CNT_IN19},
    {6u, 18u, P2_2, P2_2_TCPWM0_TR_ONE_CNT_IN1554},
    {0u, 12u, P2_3, P2_3_TCPWM0_TR_ONE_CNT_IN12},
    {0u, 16u, P2_3, P2_3_TCPWM0_TR_ONE_CNT_IN16},
    {6u, 21u, P2_3, P2_3_TCPWM0_TR_ONE_CNT_IN1557},
    {0u, 3u, P3_0, P3_0_TCPWM0_TR_ONE_CNT_IN3},
    {0u, 7u, P3_0, P3_0_TCPWM0_TR_ONE_CNT_IN7},
    {0u, 0u, P3_1, P3_1_TCPWM0_TR_ONE_CNT_IN0},
    {0u, 4u, P3_1, P3_1_TCPWM0_TR_ONE_CNT_IN4},
    {0u, 25u, P5_0, P5_0_TCPWM0_TR_ONE_CNT_IN25},
    {0u, 27u, P5_0, P5_0_TCPWM0_TR_ONE_CNT_IN27},
    {0u, 28u, P5_1, P5_1_TCPWM0_TR_ONE_CNT_IN28},
    {0u, 30u, P5_1, P5_1_TCPWM0_TR_ONE_CNT_IN30},
    {0u, 31u, P5_2, P5_2_TCPWM0_TR_ONE_CNT_IN31},
    {0u, 33u, P5_2, P5_2_TCPWM0_TR_ONE_CNT_IN33},
    {0u, 34u, P5_3, P5_3_TCPWM0_TR_ONE_CNT_IN34},
    {0u, 36u, P5_3, P5_3_TCPWM0_TR_ONE_CNT_IN36},
    {0u, 43u, P6_0, P6_0_TCPWM0_TR_ONE_CNT_IN43},
    {3u, 0u, P6_0, P6_0_TCPWM0_TR_ONE_CNT_IN768},
    {0u, 0u, P6_1, P6_1_TCPWM0_TR_ONE_CNT_IN0},
    {3u, 1u, P6_1, P6_1_TCPWM0_TR_ONE_CNT_IN769},
    {0u, 1u, P6_2, P6_2_TCPWM0_TR_ONE_CNT_IN1},
    {3u, 3u, P6_2, P6_2_TCPWM0_TR_ONE_CNT_IN771},
    {0u, 3u, P6_3, P6_3_TCPWM0_TR_ONE_CNT_IN3},
    {3u, 4u, P6_3, P6_3_TCPWM0_TR_ONE_CNT_IN772},
    {0u, 4u, P6_4, P6_4_TCPWM0_TR_ONE_CNT_IN4},
    {3u, 6u, P6_4, P6_4_TCPWM0_TR_ONE_CNT_IN774},
    {0u, 6u, P6_5, P6_5_TCPWM0_TR_ONE_CNT_IN6},
    {3u, 7u, P6_5, P6_5_TCPWM0_TR_ONE_CNT_IN775},
    {0u, 10u, P7_0, P7_0_TCPWM0_TR_ONE_CNT_IN10},
    {3u, 12u, P7_0, P7_0_TCPWM0_TR_ONE_CNT_IN780},
    {0u, 45u, P7_1, P7_1_TCPWM0_TR_ONE_CNT_IN45},
    {3u, 13u, P7_1, P7_1_TCPWM0_TR_ONE_CNT_IN781},
    {0u, 46u, P7_2, P7_2_TCPWM0_TR_ONE_CNT_IN46},
    {3u, 15u, P7_2, P7_2_TCPWM0_TR_ONE_CNT_IN783},
    {0u, 48u, P7_3, P7_3_TCPWM0_TR_ONE_CNT_IN48},
    {3u, 16u, P7_3, P7_3_TCPWM0_TR_ONE_CNT_IN784},
    {0u, 49u, P7_4, P7_4_TCPWM0_TR_ONE_CNT_IN49},
    {3u, 18u, P7_4, P7_4_TCPWM0_TR_ONE_CNT_IN786},
    {0u, 51u, P7_5, P7_5_TCPWM0_TR_ONE_CNT_IN51},
    {3u, 19u, P7_5, P7_5_TCPWM0_TR_ONE_CNT_IN787},
    {0u, 55u, P8_0, P8_0_TCPWM0_TR_ONE_CNT_IN55},
    {0u, 57u, P8_0, P8_0_TCPWM0_TR_ONE_CNT_IN57},
    {0u, 58u, P8_1, P8_1_TCPWM0_TR_ONE_CNT_IN58},
    {0u, 60u, P8_1, P8_1_TCPWM0_TR_ONE_CNT_IN60},
    {0u, 61u, P8_2, P8_2_TCPWM0_TR_ONE_CNT_IN61},
    {0u, 63u, P8_2, P8_2_TCPWM0_TR_ONE_CNT_IN63},
    {0u, 183u, P11_0, P11_0_TCPWM0_TR_ONE_CNT_IN183},
    {0u, 187u, P11_0, P11_0_TCPWM0_TR_ONE_CNT_IN187},
    {0u, 180u, P11_1, P11_1_TCPWM0_TR_ONE_CNT_IN180},
    {0u, 184u, P11_1, P11_1_TCPWM0_TR_ONE_CNT_IN184},
    {0u, 177u, P11_2, P11_2_TCPWM0_TR_ONE_CNT_IN177},
    {0u, 181u, P11_2, P11_2_TCPWM0_TR_ONE_CNT_IN181},
    {0u, 106u, P12_0, P12_0_TCPWM0_TR_ONE_CNT_IN106},
    {0u, 108u, P12_0, P12_0_TCPWM0_TR_ONE_CNT_IN108},
    {0u, 109u, P12_1, P12_1_TCPWM0_TR_ONE_CNT_IN109},
    {0u, 111u, P12_1, P12_1_TCPWM0_TR_ONE_CNT_IN111},
    {0u, 112u, P12_2, P12_2_TCPWM0_TR_ONE_CNT_IN112},
    {0u, 114u, P12_2, P12_2_TCPWM0_TR_ONE_CNT_IN114},
    {0u, 115u, P12_3, P12_3_TCPWM0_TR_ONE_CNT_IN115},
    {0u, 117u, P12_3, P12_3_TCPWM0_TR_ONE_CNT_IN117},
    {0u, 118u, P12_4, P12_4_TCPWM0_TR_ONE_CNT_IN118},
    {0u, 120u, P12_4, P12_4_TCPWM0_TR_ONE_CNT_IN120},
    {0u, 130u, P13_0, P13_0_TCPWM0_TR_ONE_CNT_IN130},
    {3u, 24u, P13_0, P13_0_TCPWM0_TR_ONE_CNT_IN792},
    {0u, 132u, P13_1, P13_1_TCPWM0_TR_ONE_CNT_IN132},
    {3u, 25u, P13_1, P13_1_TCPWM0_TR_ONE_CNT_IN793},
    {0u, 133u, P13_2, P13_2_TCPWM0_TR_ONE_CNT_IN133},
    {3u, 27u, P13_2, P13_2_TCPWM0_TR_ONE_CNT_IN795},
    {0u, 135u, P13_3, P13_3_TCPWM0_TR_ONE_CNT_IN135},
    {3u, 28u, P13_3, P13_3_TCPWM0_TR_ONE_CNT_IN796},
    {0u, 136u, P13_4, P13_4_TCPWM0_TR_ONE_CNT_IN136},
    {3u, 30u, P13_4, P13_4_TCPWM0_TR_ONE_CNT_IN798},
    {0u, 138u, P13_5, P13_5_TCPWM0_TR_ONE_CNT_IN138},
    {3u, 31u, P13_5, P13_5_TCPWM0_TR_ONE_CNT_IN799},
    {0u, 139u, P13_6, P13_6_TCPWM0_TR_ONE_CNT_IN139},
    {3u, 33u, P13_6, P13_6_TCPWM0_TR_ONE_CNT_IN801},
    {0u, 141u, P13_7, P13_7_TCPWM0_TR_ONE_CNT_IN141},
    {3u, 34u, P13_7, P13_7_TCPWM0_TR_ONE_CNT_IN802},
    {0u, 142u, P14_0, P14_0_TCPWM0_TR_ONE_CNT_IN142},
    {0u, 144u, P14_0, P14_0_TCPWM0_TR_ONE_CNT_IN144},
    {0u, 145u, P14_1, P14_1_TCPWM0_TR_ONE_CNT_IN145},
    {0u, 147u, P14_1, P14_1_TCPWM0_TR_ONE_CNT_IN147},
    {3u, 16u, P18_0, P18_0_TCPWM0_TR_ONE_CNT_IN784},
    {3u, 18u, P18_0, P18_0_TCPWM0_TR_ONE_CNT_IN786},
    {3u, 19u, P18_1, P18_1_TCPWM0_TR_ONE_CNT_IN787},
    {3u, 21u, P18_1, P18_1_TCPWM0_TR_ONE_CNT_IN789},
    {0u, 165u, P18_2, P18_2_TCPWM0_TR_ONE_CNT_IN165},
    {3u, 22u, P18_2, P18_2_TCPWM0_TR_ONE_CNT_IN790},
    {0u, 162u, P18_3, P18_3_TCPWM0_TR_ONE_CNT_IN162},
    {0u, 166u, P18_3, P18_3_TCPWM0_TR_ONE_CNT_IN166},
    {0u, 159u, P18_4, P18_4_TCPWM0_TR_ONE_CNT_IN159},
    {0u, 163u, P18_4, P18_4_TCPWM0_TR_ONE_CNT_IN163},
    {0u, 156u, P18_5, P18_5_TCPWM0_TR_ONE_CNT_IN156},
    {0u, 160u, P18_5, P18_5_TCPWM0_TR_ONE_CNT_IN160},
    {0u, 153u, P18_6, P18_6_TCPWM0_TR_ONE_CNT_IN153},
    {0u, 157u, P18_6, P18_6_TCPWM0_TR_ONE_CNT_IN157},
    {0u, 150u, P18_7, P18_7_TCPWM0_TR_ONE_CNT_IN150},
    {0u, 154u, P18_7, P18_7_TCPWM0_TR_ONE_CNT_IN154},
    {0u, 151u, P19_0, P19_0_TCPWM0_TR_ONE_CNT_IN151},
    {3u, 9u, P19_0, P19_0_TCPWM0_TR_ONE_CNT_IN777},
    {6u, 0u, P19_0, P19_0_TCPWM0_TR_ONE_CNT_IN1536},
    {0u, 78u, P19_1, P19_1_TCPWM0_TR_ONE_CNT_IN78},
    {3u, 10u, P19_1, P19_1_TCPWM0_TR_ONE_CNT_IN778},
    {6u, 1u, P19_1, P19_1_TCPWM0_TR_ONE_CNT_IN1537},
    {0u, 79u, P19_2, P19_2_TCPWM0_TR_ONE_CNT_IN79},
    {0u, 81u, P19_2, P19_2_TCPWM0_TR_ONE_CNT_IN81},
    {6u, 3u, P19_2, P19_2_TCPWM0_TR_ONE_CNT_IN1539},
    {0u, 82u, P19_3, P19_3_TCPWM0_TR_ONE_CNT_IN82},
    {0u, 84u, P19_3, P19_3_TCPWM0_TR_ONE_CNT_IN84},
    {6u, 4u, P19_3, P19_3_TCPWM0_TR_ONE_CNT_IN1540},
    {0u, 126u, P21_0, P21_0_TCPWM0_TR_ONE_CNT_IN126},
    {0u, 130u, P21_0, P21_0_TCPWM0_TR_ONE_CNT_IN130},
    {0u, 123u, P21_1, P21_1_TCPWM0_TR_ONE_CNT_IN123},
    {0u, 127u, P21_1, P21_1_TCPWM0_TR_ONE_CNT_IN127},
    {0u, 120u, P21_2, P21_2_TCPWM0_TR_ONE_CNT_IN120},
    {0u, 124u, P21_2, P21_2_TCPWM0_TR_ONE_CNT_IN124},
    {0u, 117u, P21_3, P21_3_TCPWM0_TR_ONE_CNT_IN117},
    {0u, 121u, P21_3, P21_3_TCPWM0_TR_ONE_CNT_IN121},
    {0u, 102u, P21_5, P21_5_TCPWM0_TR_ONE_CNT_IN102},
    {0u, 106u, P21_5, P21_5_TCPWM0_TR_ONE_CNT_IN106},
    {0u, 111u, P21_5, P21_5_TCPWM0_TR_ONE_CNT_IN111},
    {0u, 115u, P21_5, P21_5_TCPWM0_TR_ONE_CNT_IN115},
    {0u, 99u, P22_1, P22_1_TCPWM0_TR_ONE_CNT_IN99},
    {0u, 103u, P22_1, P22_1_TCPWM0_TR_ONE_CNT_IN103},
    {0u, 96u, P22_2, P22_2_TCPWM0_TR_ONE_CNT_IN96},
    {0u, 100u, P22_2, P22_2_TCPWM0_TR_ONE_CNT_IN100},
    {0u, 93u, P22_3, P22_3_TCPWM0_TR_ONE_CNT_IN93},
    {0u, 97u, P22_3, P22_3_TCPWM0_TR_ONE_CNT_IN97},
    {3u, 31u, P23_3, P23_3_TCPWM0_TR_ONE_CNT_IN799},
    {3u, 33u, P23_3, P23_3_TCPWM0_TR_ONE_CNT_IN801},
    {0u, 75u, P23_4, P23_4_TCPWM0_TR_ONE_CNT_IN75},
    {3u, 34u, P23_4, P23_4_TCPWM0_TR_ONE_CNT_IN802},
    {0u, 72u, P23_5, P23_5_TCPWM0_TR_ONE_CNT_IN72},
    {0u, 76u, P23_5, P23_5_TCPWM0_TR_ONE_CNT_IN76},
    {0u, 69u, P23_6, P23_6_TCPWM0_TR_ONE_CNT_IN69},
    {0u, 73u, P23_6, P23_6_TCPWM0_TR_ONE_CNT_IN73},
    {0u, 66u, P23_7, P23_7_TCPWM0_TR_ONE_CNT_IN66},
    {0u, 70u, P23_7, P23_7_TCPWM0_TR_ONE_CNT_IN70},
};

#endif
